[
  {
    "id": "1",
    "artist": "Florence + The Machine",
    "stage": "Main Stage",
    "day": "Tuesday",
    "startTime": "2026-08-11T17:00:00Z",
    "endTime": "2026-08-11T18:00:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "POP",
      "POP-ROCK",
      "INDIE ROCK",
      "INDIE POP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064800-florence-%2B-the-machine",
    "socials": {
      "website": "https://florenceandthemachine.net/",
      "facebook": "https://www.facebook.com/florenceandthemachine",
      "instagram": "https://www.instagram.com/florenceandthemachine",
      "tiktok": "https://www.tiktok.com/@florence",
      "youtube": "https://www.youtube.com/@florencemachine",
      "spotify": "https://open.spotify.com/artist/1moxjboGR7GNWYIMWsRjgG",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/gb/artist/florence-the-machine/281070699",
      "x": "https://x.com/florencemachine"
    },
    "description": "Florence Welch - also known as Florence + The Machine - has announced her sixth studio album Everybody Scream, set for release on October 31.\n\nThe album’s title track Everybody Scream was written and produced by Florence Welch over the past two years with a close-knit circle of collaborators including Mark Bowen of IDLES, who appears in the video for the single, Aaron Dessner and Mitski. \n\nAfter needing lifesaving surgery on the Dance Fever Tour, Florence’s recovery took her down the path of spiritual mysticism, witchcraft and folk horror as she felt the limits of her body and explored what it means to be “healed”. The album treads through womanhood, partnership, aging and dying; exposing the murky in the mundane.\n\nAcross five albums - 2009’s Lungs, 2011’s Ceremonials, 2015’s How Big, How Blue, How Beautiful, 2018’s High As Hope and 2022’s Dance Fever - Florence has become one of the most monumental artists of a generation, with multiple US and UK #1 albums and countless awards. Known for her earth-shattering live show and singular, iconic voice, Florence has sold out shows and headlined festivals the entire world over. She has collaborated and shared stages with icons - The Rolling Stones, Lady Gaga and Taylor Swift among them - and published a book of lyrics, poetry and drawings, Useless Magic.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/82/thumb_5581803_performance_1440.jpeg",
    "vibes": [
      "Ethereal",
      "Sing-along",
      "Emotional"
    ]
  },
  {
    "id": "2",
    "artist": "Lewis Capaldi",
    "stage": "Main Stage",
    "day": "Wednesday",
    "startTime": "2026-08-12T17:30:00Z",
    "endTime": "2026-08-12T18:30:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ROCK",
      "POP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064849-lewis-capaldi",
    "socials": {
      "website": "https://www.lewiscapaldi.com/",
      "facebook": "https://www.facebook.com/lewiscapaldi",
      "instagram": "https://www.instagram.com/lewiscapaldi",
      "tiktok": "https://www.tiktok.com/@lewiscapaldi",
      "youtube": "https://www.youtube.com/channel/UCveFkLdSOUsGwMJEgedO9dQ",
      "spotify": "https://open.spotify.com/artist/4GNC7GD6oZMSxPGyXy4MNB",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/us/artist/lewis-capaldi/1213405916",
      "x": "https://x.com/lewiscapaldi"
    },
    "description": "Global superstar Lewis Capaldi returns with ‘Almost’ - a soaring, full-band anthem marking his third new single since his comeback. The track arrives ahead of his newly announced EP Survive - out November 14th. Arriving hot on the heels of a critically-lauded return to touring after almost 2 years away, and latest success ‘Something In The Heavens’, his tenth UK Top 10 single, ‘Almost’ is a raw and intimate exploration of what it means to move on - or at least try to. Honest and understated, the song captures the struggle to let go. “I swear to God I’m almost alright, I only think about you all the time,” Lewis admits, showcasing yet again his extraordinary gift for finding truth and emotion in the most nuanced of details.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577157_performance_1440.jpeg",
    "vibes": [
      "Emotional",
      "Sing-along",
      "Heartfelt"
    ]
  },
  {
    "id": "3",
    "artist": "Sombr",
    "stage": "Main Stage",
    "day": "Thursday",
    "startTime": "2026-08-13T17:00:00Z",
    "endTime": "2026-08-13T18:00:00Z",
    "countryCode": "US",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "ALTERNATIVE",
      "ALT POP",
      "INDIE ROCK",
      "ALTERNATIVE ROCK"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064847-sombr",
    "socials": {
      "website": "https://www.sombrmusic.com/",
      "facebook": "https://www.facebook.com/s0mbr",
      "instagram": "https://www.instagram.com/sombr",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@sombr",
      "youtube": "https://www.youtube.com/channel/UCXlqFQmZZOb78teSnAqhuwA",
      "spotify": "https://open.spotify.com/artist/4G9NDjRyZFDlJKMRL8hx3S",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/us/artist/sombr/1589842503",
      "soundcloud": "https://soundcloud.com/sombrsongs"
    },
    "description": "A New York City-native raised on the Lower East Side, sombr—born Shane Boose—started making music in his bedroom while studying classical music as a student at the prestigious public school, LaGuardia High School. His breakout hit “Caroline” (2022) took the internet by storm, and he has since released a series of EPs and singles - all self-written and co-produced by the artist himself - that has propelled him to 500 million monthly streams across platforms. In August of 2025, he released his debut full-length album I Barely Know Her [Warner Records] which landed at #1 in Spotify’s Global Albums Chart and features the three Billboard Hot 100 hits “back to friends,” “undressed” and “12 to 12.” “undressed” took the #1 spot at Alternative Radio faster than any new artist of the last decade, while “back to friends” has crossed 1 BILLION streams and earned sombr his first Video Music Award for “Best Alternative.” With “12 to 12” following in the same footsteps, sombr took the #1 spot on the Hot 100 Songwriters Chart for 5 straight weeks. Now based in Los Angeles, sombr is currently on his sold-out world tour, playing his first arena shows and upgraded venues to accommodate demand, winding across North America before he heads to Australia in December and Europe and the U.K. in the spring of 2026.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577150_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Chill",
      "Atmospheric",
      "Unique",
      "Live Band",
      "Sing-along",
      "Feel-good"
    ]
  },
  {
    "id": "4",
    "artist": "Twenty One Pilots",
    "stage": "Main Stage",
    "day": "Friday",
    "startTime": "2026-08-14T17:30:00Z",
    "endTime": "2026-08-14T18:30:00Z",
    "countryCode": "US",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "POP",
      "ALTERNATIVE",
      "INDIE POP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064850-twenty-one-pilots",
    "socials": {
      "website": "https://www.twentyonepilots.com/",
      "facebook": "https://www.facebook.com/twentyonepilots",
      "instagram": "https://www.instagram.com/twentyonepilots",
      "tiktok": "https://www.tiktok.com/@twentyonepilots",
      "youtube": "https://www.youtube.com/channel/UCBQZwaNPFfJ1gZ1fLZpAEGw",
      "spotify": "https://open.spotify.com/artist/3YQKmKGau1PzlVlkL1iodx",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/us/artist/twenty-one-pilots/349736311",
      "x": "https://twitter.com/twentyonepilots"
    },
    "description": "Grammy-Award winning band, Twenty One Pilots, have shifted music and culture as an incomparable creative force and with an ever-evolving vision. The Columbus, OH duo—Tyler Joseph and Josh Dun— have tallied over 33 billion global streams and counting, sold north of three million tickets worldwide, notched dozens of multi-Platinum certifications, and even claimed a spot in the Guinness® Book of World Records. In historic fashion, their quadruple-Platinum breakout LP, Blurryface, took flight as “the first album to notch a RIAA Gold or Platinum certification for every one of its songs, while Vessel followed suit and achieved the same distinction. They elevated to rarified air as “one of only 18 artists to earn multiple RIAA Diamond certifications,” going Diamond with “Stressed Out” and “Heathens.” 2018’s Platinum-certified Trench extended the ambitious concept laid out in Blurryface and delivered the multi-Platinum and Platinum singles: “Chlorine,” “My Blood” and the GRAMMY® Award-nominated “Jumpsuit.” They followed Trench with their Gold-certified LP Scaled And Icy, achieving “the biggest opening week for a rock album in 2021” by capturing #1 on the Billboard Top Rock Albums and Top Alternative Albums charts and crashing the Top 3 of the Billboard 200. Beyond rapturous headline shows at arenas and festivals worldwide, Twenty One Pilots have notably architected an immersive world without comparison, originating a multi-album conceptual arc across Blurryface, Trench, Scaled And Icy, and Trench. In 2024, the band released their seventh full-length offering, Clancy [Fueled By Ramen], which shattered records as the biggest rock debut AND biggest rock album overall of 2024. Led by the single “Overcompensate,” the LP signals the dawn of another era for Twenty One Pilots and alternative rock music at large. The band closed out the year with “The Line,” an original track for Netflix’s Arcane Season 2 that has already seen massive growth on streaming platforms. Just weeks after wrapping their massive Clancy World Tour, Twenty One Pilots announced their latest record, Breach, which marks the long-awaited conclusion to the story first introduced a decade ago on Blurryface. The first single off the record, “The Contract,” marked the biggest song debut of the band’s career and reached #1 on the Alternative Airplay chart, their 12th time accomplishing this feat. Following the album’s release on September 12, the band kicks off THE CLANCY TOUR: BREACH 2025, which will hit stadiums and amphitheatres across North America, closing with two nights at BMO Stadium in Los Angeles.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577159_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Moshpit",
      "Genre-bending"
    ]
  },
  {
    "id": "5",
    "artist": "Ashnikko",
    "stage": "Main Stage",
    "day": "Saturday",
    "startTime": "2026-08-15T17:00:00Z",
    "endTime": "2026-08-15T18:00:00Z",
    "countryCode": "US",
    "genres": [
      "MUSIC",
      "POP",
      "HIP-HOP",
      "ELECTROPOP",
      "ALT POP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065315-ashnikko",
    "socials": {
      "website": "https://www.ashnikko.com/",
      "facebook": "https://www.facebook.com/ashnikkomusic",
      "instagram": "https://www.instagram.com/ashnikko",
      "tiktok": "https://www.tiktok.com/@ashnikko",
      "youtube": "https://www.youtube.com/channel/UCprhwr86ckrMC2q9jX8qMnw",
      "spotify": "https://open.spotify.com/artist/3PyJHH2wyfQK3WZrk9rpmP",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/us/artist/ashnikko/721130075",
      "x": "https://x.com/ashnikko"
    },
    "description": "Ashnikko (Ashton Nicole Casey) is an American rapper, singer-songwriter, and producer currently based in London. She grew up in Greensboro, North Carolina, then moved with her family to Estonia and later to Riga, Latvia during her teenage years. She released her first track, KROKODIL, in 2016, followed by her debut EP Sass Pancakes in 2017. Her next EPs, Unlikeable (2018) and Hi It’s Me (2019), continued to build her audience. In 2019, her single Stupid went viral on TikTok and became her breakthrough hit. Her first mixtape, DEMIDEVIL, arrived in 2021, featuring viral songs like Daisy and Slumber Party. In 2023, she released her debut studio album WEEDKILLER. She also wrote a diss track about a classmate and co-wrote Boss Bitch with Doja Cat for the Birds of Prey soundtrack.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/80/thumb_5579811_performance_1440.jpeg",
    "vibes": [
      "Wild",
      "Dance",
      "Bold"
    ]
  },
  {
    "id": "6",
    "artist": "Bbno$",
    "stage": "Revolut Stage",
    "day": "Tuesday",
    "startTime": "2026-08-11T17:30:00Z",
    "endTime": "2026-08-11T18:30:00Z",
    "countryCode": "CA",
    "genres": [
      "MUSIC",
      "HIP-HOP",
      "RAP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064842-bbno%24",
    "socials": {
      "website": "https://bbnomula.com/",
      "facebook": "https://www.facebook.com/bbnomula",
      "instagram": "https://www.instagram.com/bbnomula",
      "tiktok": "https://www.tiktok.com/@bbnotiktok",
      "youtube": "https://www.youtube.com/channel/UCC8FSfSnbjiZ6vGr68ZLtzg",
      "spotify": "https://open.spotify.com/artist/41X1TR6hrK8Q2ZCpp2EqCz",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/bbno%24/1161580951",
      "x": "https://x.com/bbnomula"
    },
    "description": "Hailed by Rolling Stone as “A Viral Pioneer”, bbno$ is no stranger to producing addictive hooks, having released the first ever TikTok thit, ‘Lalala’ with Y2K in 2019, which has gone 10x Platinum across the globe.  Unlike a lot of his counterparts who's fame stemmed from a \"TikTok hit\", bbno$'s fame was no \"flash in the pan\" and his artistry quickly came to be respected in 2021 when he recreated his virality with his next hyper-successful hit \"Edamame\" which has gone 8x Platinum globally. He had opportunities flow in from his success with a performance at the JUNO’s, guest appearance during Coachella, a Late Night TV performance on Jimmy Kimmel, amongst many others.  Over the years, bbno$ has become a case study in how to succeed as an independent artist. The sheer success accumulated by the young artist is evidenced by the fact that he has been featured in Billboard, Flaunt, tmrw, Rolling Stone, NME, Lady Gunn, SPIN, Euphoria, i-D, Ones to Watch and many other publications. His work as an artist and songwriter has received praise and support from the likes of both Capital FM and BBC R1’s Jack Saunders, and Triple J. In 2023 bbno$ released his 3rd album with Yung Gravy, Baby Gravy 3 and immediately went on to sell 3-5K cap rooms on the Baby Gravy tour across North America, Australia & NZ. 2024 has seen the massive success of bbno$'s singles \"lil freak\", \"it boy\", and \"two\" driving a staggering 750M views across 1.4M UGC videos while attaining roughly 140M streams across DSPs on those 3 singles alone. Off the success of “lil freak”, \"it boy\" and \"two\", bbno$ has grown by more than 2.5M followers across socials in just the past 8 months. In 2025 he will continue releasing singles at the top of the year leading into his ninth studio album slated to drop in October while also embarking on a world tour - a sold out 1.5-3.5K cap North American headline run (first time back solo since 2021), a sold out 1500-3K cap EU/UK, 3-5K cap in AU/NZ, and an unannounced 1-2K cap in SEA and Central/South America. You won't have to look far to keep your eye on him as he implements viral stunts across the globe and continues to collaborate with creators and people of influence across the internet.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577125_performance_1440.jpeg",
    "vibes": [
      "Flow",
      "Party"
    ]
  },
  {
    "id": "7",
    "artist": "Biffy Clyro",
    "stage": "Revolut Stage",
    "day": "Wednesday",
    "startTime": "2026-08-12T17:00:00Z",
    "endTime": "2026-08-12T18:00:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ROCK",
      "ALTERNATIVE ROCK"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065608-biffy-clyro",
    "socials": {
      "website": "https://www.biffyclyro.com/",
      "facebook": "https://www.facebook.com/biffyclyro",
      "instagram": "https://www.instagram.com/biffy_clyro",
      "tiktok": "https://www.tiktok.com/@biffyclyro",
      "youtube": "https://www.youtube.com/@biffyclyro",
      "spotify": "https://open.spotify.com/artist/1km0R7wy712AzLkA1WjKET",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/us/artist/biffy-clyro/3024622",
      "soundcloud": "https://soundcloud.com/biffyclyro",
      "x": "https://x.com/BiffyClyro"
    },
    "description": "Biffy Clyro are one of the UK's most successful rock bands, they have released 3 UK number 1 albums to date and performed numerous headline sets at the likes of Reading & Leeds, Download, TRNSMT and Isle of Wight.\n\nTheir highly anticipated new album ‘Futique’ is set to release on 26th September, featuring new single ‘A Little Love’, which debuted as Hottest Record in the world on BBC Radio One. Following highly celebrated sets headlining this year’s TRNSMT Festival and on the Pyramid Stage at Glastonbury Festival, the band have received high praise from the likes of The Guardian: ‘an absolutely triumphant reminder that they… have a formidable greatest hits set when they need it’ and Kerrang!: ‘a masterclass in joy and professionalism, with every element finely tuned’ and are now set to embark on their next UK & European headline tour in 2026.\n\nTo celebrate the release of their previous album - UK number 1 ‘A Celebration of Endings’ - the band performed the record in full on their ground-breaking livestream from Glasgow’s Barrowland Ballroom in 2020. They later won Best Entertainment at the BAFTA Scotland Awards for this livestream performance. Biffy have received countless awards, including: four NME Awards (2 x Best British Band, Best Live Band and Best Music Video); five Kerrang! Awards (2 x Best British Band, Classic Songwriter, Best Album and Best Music Video); and two Q Awards (Best Live Band and Best Album). They’ve also been nominated for three BRIT Awards (all for Best British Group, most recently in 2021) and a Mercury Prize.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/82/thumb_5581804_performance_1440.jpeg",
    "vibes": [
      "Anthemic",
      "Moshpit",
      "Live Power"
    ]
  },
  {
    "id": "8",
    "artist": "Dijon",
    "stage": "Revolut Stage",
    "day": "Thursday",
    "startTime": "2026-08-13T17:30:00Z",
    "endTime": "2026-08-13T18:30:00Z",
    "countryCode": "US",
    "genres": [
      "MUSIC",
      "INDIE",
      "ALTERNATIVE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064846-dijon",
    "socials": {
      "website": "https://www.dijondijon.com/",
      "facebook": "https://www.facebook.com/DijonOfficial",
      "instagram": "https://www.instagram.com/dijondijon_",
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UC-rr-YumyDDWDE9BjGYrnIQ",
      "spotify": "https://open.spotify.com/artist/0knGpCTbmG4ctl1wzYRZs4",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/dijon/1292964044",
      "x": "https://x.com/dijondijon_"
    },
    "description": "Dijon Duenas (simply known as Dijon) is an American alternative/R&B singer-songwriter and producer, also known as the former vocalist of the R&B duo Abhi//Dijon. After the duo released two projects respectively in 2015 and 2016, Dijon began to step into his own in 2017, releasing a string of solo singles, including \"Skin\" and \"Nico's Red Truck\". His debut EP Sci Fi 1 was released in 2019 under the Warner-supported label R&R Digital, and was shortly followed by How Do You Feel About Getting Married the following year. He eventually released his debut album Absolutely on November 5, 2021, which included the single \"Many Times\".",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577140_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric",
      "Unique",
      "Live Band"
    ]
  },
  {
    "id": "9",
    "artist": "Dom Dolla",
    "stage": "Revolut Stage",
    "day": "Friday",
    "startTime": "2026-08-14T17:00:00Z",
    "endTime": "2026-08-14T18:00:00Z",
    "countryCode": "AU",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECH-HOUSE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065311-dom-dolla",
    "socials": {
      "website": "https://www.domdolla.com/",
      "facebook": "https://www.facebook.com/domdollamusic",
      "instagram": "https://www.instagram.com/domdolla",
      "tiktok": "https://www.tiktok.com/@domdolla",
      "youtube": "https://www.youtube.com/@DomDolla",
      "spotify": "https://open.spotify.com/artist/205i7E8fNVfojowcQSfK9m",
      "appleMusic": "https://music.apple.com/us/artist/http://music.apple.com/au/artist/dom-dolla/555348065",
      "soundcloud": "https://soundcloud.com/domdolla",
      "x": "https://twitter.com/domdolla"
    },
    "description": "Grammy nominated DJ, producer & songwriter, DOM DOLLA, is experiencing a meteoric rise, his signature style of house music is connecting with global audiences, and he is recognised as one of the most exciting producers in electronic music. Dom discovered house music when his Mother handed him a copy of Basement Jaxx’ 2001 album ‘Rooty\". In his late teen’s Dom spent weekends hosting pub‐discos & djing at parties whilst working as a graphic‐designer during the week. In 2015 Dom was encouraged to quit his day job to pursue his obsession with music and production. Dom emerged with a string of critically acclaimed club hits; Define, You, Be Randy, Take It, San Frandisco, Pump The Breaks, Moving Blind and Strangers ft. Mansionair. In 2022 Dom released ‘Miracle Maker’ ft. Clementine Douglas which was named BBC Radio 1’s Hottest Record In The World, propelling Dom into his global break‐out moment with a run of hit singles, Rhyme Dust w/ MK, Eat Your Man w/ Nelly Furtado, Saving Up, girl$, CAVE w/ Tove Lo, Dreamin ft. Daya, and Forever (with Kid Cudi) which saw Dom’s catalog surpass 1 BILLION streams. In 2025, Dom made his cinematic debut with the single “No Room For A Saint” w/ Nathan Nicholson, released as part of the ‘F1: The Movie’ soundtrack. Dom received a GRAMMY nomination for his remix of ‘New Gold’ by Gorillaz feat. Tame Impala & Bootie Brown, and has won the ARIA award for best ‘Dance / Electronic Release’ three times. His dedication & craft has been recognised by GQ’s ‘Solo Artist of the Year’, labeled Billboard Dance’s ‘One To Watch’, awarded Dancing Astronaut’s ‘Artist Of The Year’’, and was celebrated on the cover of DJ Mag and Rolling Stone Australia.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/80/thumb_5579847_performance_1440.jpeg",
    "vibes": [
      "Banger",
      "Dance",
      "Summer"
    ]
  },
  {
    "id": "10",
    "artist": "Indira Paganotto",
    "stage": "Revolut Stage",
    "day": "Saturday",
    "startTime": "2026-08-15T17:30:00Z",
    "endTime": "2026-08-15T18:30:00Z",
    "countryCode": "ES",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECHNO"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064818-indira-paganotto",
    "socials": {
      "website": "https://indirapaganotto.com/",
      "facebook": "https://www.facebook.com/IndiraPaganotto",
      "instagram": "https://www.instagram.com/indirapaganotto",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@indirapaganotto",
      "youtube": "https://www.youtube.com/channel/UCf3l3_b96kU7z6wF0izwo-g",
      "spotify": "https://open.spotify.com/artist/0JXc5G7ZImFTwPg3y8MTfR",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/indira-paganotto/501964677",
      "soundcloud": "https://soundcloud.com/indirapaganotto"
    },
    "description": "Born in 1992, today Indira Paganotto is one of Spain’s most prominent figures in the world of music. Her sets are full of energy and undeniable danceability. In the last 13 years she has changed the dance music industry, being the driving force behind a new sound, psy-techno. At the age of just 17 she signed a total of 3 vinyl releases to Ian Pooley’s label Pooled Music, after he discovered her during a warm-up set she played in Gran Canaria. Soon after, she moved to Madrid where she could focus on producing and DJ’ing at a bigger scale. Her debut collaboration with Nina Kraviz in 2023 for ‘White Horse’ on Trip, also came with the launch of her label ARTCORE with her EP ‘Guns & Horses’. Today, ARTCORE is spearheading the ‘psy-techno’ movement, a genre the label has effectively crafted itself over its last 15 releases. They charge into 2025 with ARTCORE curated stages at the world’s biggest festivals. Indira’s rise has been unstoppable, from remixing Depeche Mode’s ‘People Are Good’ to headlining all major clubs and events, with upcoming performances at Coachella, Tomorrowland, EXIT, Sonar, Awakenings and Mysteryland. But it’s at Monegros she’ll make history as the first women to ever close the main stage in July and will be taking over Ibiza with her brand-new residency at Hi Ibiza, over 14 weeks of the summer. Although 2025 looks to be ger biggest year yet, also with a debut album release, she remains humble and dedicated to her work, with infectious energy and a smile as bright as her fue.",
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577096_performance_1440.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Hard"
    ]
  },
  {
    "id": "11",
    "artist": "Tash Sultana",
    "stage": "Bolt Party Arena",
    "day": "Tuesday",
    "startTime": "2026-08-11T18:00:00Z",
    "endTime": "2026-08-11T19:00:00Z",
    "countryCode": "AU",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "HIP-HOP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064844-tash-sultana",
    "description": "Renowned multi-instrumentalist, singer, songwriter, and producer Tash Sultana is making their long-awaited return to the EU/UK in March 2026. These will be Tash’s first shows in the region since 2023, and they’re back by high demand, marking the biggest headline performances of their career in this market to date. The Return to the Roots EU/UK 2026 Tour follows the release of Tash’s most recent body of work and promises fans a powerful new live experience. From beloved fan favourites to unreleased material, this tour will showcase a completely reimagined production and stage show—an evolution of the raw, electrifying performances Tash is globally celebrated for. The release of Return to the Roots EP is the beginning of an exciting new chapter for Tash. a raw and fearless six-track EP that peels back the layers of fame and expectation to reconnect with the core of their artistry. A decade into their journey, Tash revisits the magic of their early looping days, blending nostalgic spontaneity with hard-earned wisdom. With a sound rooted in live energy and emotional truth, the EP explores themes of mental health, resilience, self-discovery, and the quiet power of authenticity. From stripped-back jams to deeply personal anthems, Return to the Roots isn’t just a reflection—it’s a reclamation. It marks a powerful return to the essence of who Tash is: an artist unbound by genre, pressure, or convention—just pure, unfiltered expression. Having amassed over a billion streams, headlined major festivals, sold-out arena tours across the globe and performed to hundreds of thousands of fans worldwide, Tash stands as one of Australia’s most influential and celebrated artists. Don't miss the chance to witness one of the most dynamic live acts of a generation as Tash Sultana brings their genre-defying sound back to EU/UK stages",
    "socials": {
      "website": "https://www.tashsultana.com/",
      "facebook": "https://www.facebook.com/tashsultanamusic",
      "instagram": "https://www.instagram.com/tashsultanaofficial",
      "tiktok": null,
      "youtube": "https://www.youtube.com/@tashsultana01",
      "spotify": "https://open.spotify.com/artist/6zVFRTB0Y1whWyH7ZNmywf",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/tash-sultana/1105306265",
      "soundcloud": "https://soundcloud.com/tash-sultana",
      "x": "https://x.com/tashsultanaa"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577136_performance_1440.jpeg",
    "vibes": [
      "Loop-master",
      "Trippy",
      "Chill"
    ]
  },
  {
    "id": "12",
    "artist": "Tomora",
    "stage": "Bolt Party Arena",
    "day": "Wednesday",
    "startTime": "2026-08-12T18:30:00Z",
    "endTime": "2026-08-12T19:30:00Z",
    "countryCode": null,
    "genres": [
      "MUSIC",
      "INDIE",
      "ELECTRONIC"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064840-tomora",
    "description": "TOMORA, the new duo featuring The Chemical Brothers’ Tom Rowlands and AURORA, have released their debut single “RING THE ALARM,” out now via Capitol Records. It arrives alongside a BBC Radio 1 premiere with Jack Saunders and an official music video directed by Adam Smith, a visual that compliments the track’s fun and chaotic nature. Until now, TOMORA’s identity was unknown, with their presence on next year’s festival lineups for Coachella, NOS Alive, Colours of Ostrava, Øya and Down The Rabbit Hole sparking online speculation on Reddit, Discord, and more as to who the mysterious act may be. But today, all is revealed. TOMORA is two entities - TOM and ORA - as one. And by way of an introduction to their world, they have unleashed “RING THE ALARM” ; a glorious, mechanized sound of alien contact, alive with chaos, mischief and release. It's a record that slips across eras, and a sharp reminder of what 33 revolutions per minute can do. Of the single, the duo say: “We wanted TOMORA to be a band, not two individuals. It’s our musical feeling come to life.” TOMORA is the result of two unique and pioneering artists’ worlds colliding, inevitably. As one half of The Chemical Brothers, Tom Rowlands has defined the sound of British electronic music, and AURORA has established herself one of pop music’s most distinctive voices. Their orbits began to converge, and before long AURORA featured on The Chemical Brothers’ GRAMMY® Award-winning 2019 album No Geography - a favor returned when Tom produced some of her acclaimed 2024 album What Happened To The Heart?. The natural chemistry between the two artists, and alchemy that came from their collaboration, has led us to this point: “RING THE ALARM.”",
    "socials": {
      "website": "https://www.tomora.com/",
      "facebook": "https://www.facebook.com/tomoraofficial",
      "instagram": "https://www.instagram.com/tomora",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@tomora_official",
      "youtube": "https://www.youtube.com/@watch",
      "spotify": "https://open.spotify.com/artist/5r0BuurxKQugj8cjHiO8pY",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/gb/artist/tomora/1852575872",
      "soundcloud": "https://soundcloud.com/tomoraofficial"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580979_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric",
      "Dance",
      "Rave"
    ]
  },
  {
    "id": "13",
    "artist": "Underworld",
    "stage": "Bolt Party Arena",
    "day": "Thursday",
    "startTime": "2026-08-13T18:00:00Z",
    "endTime": "2026-08-13T19:00:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECHNO",
      "HOUSE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065313-underworld",
    "description": "Underworld are Rick Smith and Karl Hyde. Over 30 years since their peerless first album, dubnobasswithmyheadman, and their generation-defining euphoric hit, ‘Born Slippy (Nuxx)’, they are going from strength to strength. 2025 marks a modern renaissance for the group, which already has over 40 years of experience. Their Boiler Room debut this summer saw over one million views in the first five days, and upon the recent re-reissue of their first seven studio albums, all seven went straight to the top of the album charts - a feat never before achieved by a single artist. With a sold-out 2025 USA tour, countless festival headlining slots, and continuous collaborations with seminal talents such as Brutalisimus3000, KETTAMA, and KI/KI, Underworld’s consistent artistry and visceral live shows cement their place in both electronic music’s history and its future.",
    "socials": {
      "website": "https://www.underworldlive.com/",
      "facebook": "https://www.facebook.com/underworldlive",
      "instagram": "https://www.instagram.com/underworld",
      "tiktok": "https://www.tiktok.com/@underworldlive",
      "youtube": "https://www.youtube.com/channel/UCL2yEhXEN6umpyZYJhX4e7g",
      "spotify": "https://open.spotify.com/artist/1PXHzxRDiLnjqNrRn2Xbsa",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/underworld/996876",
      "x": "https://x.com/underworldlive"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580030_performance_1440.jpeg",
    "vibes": [
      "Legendary",
      "Rave",
      "Iconic"
    ]
  },
  {
    "id": "14",
    "artist": "Alt Blk Era",
    "stage": "Bolt Party Arena",
    "day": "Friday",
    "startTime": "2026-08-14T18:30:00Z",
    "endTime": "2026-08-14T19:30:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ROCK",
      "ELECTRONIC",
      "ALT POP",
      "RAP",
      "DNB"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064843-alt-blk-era",
    "description": "Winners of the 2025 MOBO Award for Best Alternative Music Act, ALT BLK ERA are UK sister duo Nyrobi (21) and Chaya (18). Their debut album Rave Immortal - a UK Rock & Metal No.1 - is a genre-smashing blend of Electronic sounds fused with Rock and DnB, proving their ability to bring underground club energy into alternative spaces. As well as lighting up Spotify editorial playlists and UK radio, the sisters have also showcased their sound on major UK platforms, performing live on Later… with Jools Holland and Channel 4’s Sunday Brunch, cementing their reputation as one of the most exciting new forces in genre-fluid music. BBC Introducing hailed them as Ones to Watch in 2025 before they represented the UK at SXSW, Texas showcasing at The British Music Embassy. They have also delivered standout performances at iconic UK and EU festivals, where their raw energy leave audiences in no doubt that ALT BLK ERA are redefining what alternative, electronic and rock music can be. Press acclaim has come from NME, REVOLVER and Kerrang!, with the Brit Awards calling their sound “break the repeat button.” Beyond the music, the sisters advocate for hidden disability awareness and inclusivity in the industry, inspired by Nyrobi’s personal journey - a theme woven through Rave Immortal. With a growing international profile, ALT BLK ERA are proving themselves as one of the most forward-thinking acts shaping the future of alternative sound.",
    "socials": {
      "website": "https://www.altblkera.com/",
      "facebook": null,
      "instagram": "https://www.instagram.com/altblkera",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@altblkera",
      "youtube": "https://www.youtube.com/@ALTBLKERA",
      "spotify": "https://open.spotify.com/artist/4FNR2qdCVKGAep4alfgt25",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/gb/artist/alt-blk-era/1592491437"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577128_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Dance",
      "Rave",
      "Sing-along",
      "Feel-good",
      "Flow",
      "Party",
      "Hard"
    ]
  },
  {
    "id": "15",
    "artist": "Anna",
    "stage": "Bolt Party Arena",
    "day": "Saturday",
    "startTime": "2026-08-15T18:00:00Z",
    "endTime": "2026-08-15T19:00:00Z",
    "countryCode": "BR",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECHNO"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064839-anna",
    "description": "ANNA (Ana Miranda), the Lisbon-based Brazilian DJ and producer, has embraced spiritual exploration and sound healing alongside her techno career. After two decades of performing globally at festivals like Coachella, Time Warp, and Sónar, and collaborating with artists such as Jon Hopkins, Depeche Mode, and Stephan Bodzin, she has undergone a profound personal and artistic transformation.\n\nHer recent work, including the 2023 ambient LP Intentions and various remixes, reflects her focus on conscious music, inner stillness, and collective healing. Combining high-energy dancefloor sets with meditative soundscapes, ANNA integrates live instruments, voice, and intentionality into her practice. Guided by spiritual insights, she now channels music as a tool for healing, connection, and purposeful expression, blending techno mastery with a deeper, transformative vision.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/djannabr",
      "instagram": "https://www.instagram.com/djannaofficial",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/@annamusic",
      "spotify": "https://open.spotify.com/artist/3wkaDi2HJV3eCaBJ4iH6om",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/anna/1354964026",
      "soundcloud": "https://soundcloud.com/dj_anna"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577123_performance_1440.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Hard"
    ]
  },
  {
    "id": "16",
    "artist": "Antony Szmierek",
    "stage": "Colosseum",
    "day": "Tuesday",
    "startTime": "2026-08-11T18:30:00Z",
    "endTime": "2026-08-11T19:30:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "INDIE",
      "HIP-HOP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064845-antony-szmierek",
    "description": "Manchester-based poet, writer, and producer Antony Szmierek today delights fans with the digital deluxe release of his critically acclaimed debut album, Service Station at the End of the Universe. Originally released earlier this year to a wave of five-star reviews, the expanded edition features fan-favourite singles ‘The Hitchhiker’s Guide to the Fallacy,’ ‘The Great Pyramid of Stockport,’ ‘Yoga Teacher,’ and ‘Angie’s Wedding,’ alongside two new tracks: ‘That Face You Make When It’s Raining’ and ‘Girlypops.’",
    "socials": {
      "website": "https://www.antonyszmierek.co.uk/",
      "facebook": "https://www.facebook.com/antonyszmierek",
      "instagram": "https://www.instagram.com/antonyszmierek",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UC-VwXR6M4HD4Wo1UpTBi4SA",
      "spotify": "https://open.spotify.com/artist/1odn2oz1bEsGWugQ8W3zhn",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/antony-szmierek/1526061771",
      "soundcloud": "https://soundcloud.com/antonyszmierek"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577137_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric",
      "Flow",
      "Party"
    ]
  },
  {
    "id": "17",
    "artist": "Baby Lasagna",
    "stage": "Colosseum",
    "day": "Wednesday",
    "startTime": "2026-08-12T18:00:00Z",
    "endTime": "2026-08-12T19:00:00Z",
    "countryCode": "HR",
    "genres": [
      "MUSIC",
      "ROCK",
      "POP PUNK",
      "METAL"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065607-baby-lasagna",
    "description": "Baby Lasagna, Marko Purisic's musical project, was born out of songwriters need for artistic expression that will let him write and perform music without any strict genre limitations. With Baby Lasagna Marko has finally found a niche within which he can combine incompatible genres and create new audio sounds that are both fresh and exciting. The music was first presented publicly in late 2023. with singles \"IG BOY\" and \"Dont hate yourself, but dont love yourself too much\", and then absolutely exploded globally with \"Rim Tim Tagi Dim\" in the first half of 2024. The song won Croatian ESC contest Dora in February and went on to place second at Eurovision contest in Sweden in May, winning by far most public televotes from fans all over the globe. The song has now surpassed 35 millions streams on Spotity, and has spent some time at Top 40 official charts in territories such as UK, Germany, Austria etc. After a phenomenal ESC run, Baby Lasagna story took off super fast, with signing of a global record deal with Polydor / Universal Germany, selling out 3 stadium shows in Zagreb Croatian in one day, and selling out numerous shows across Croatia, Balkans and Europe. After a hugely successful first few live shows this spring and with over 60 shows booked until end of April 2025., the future really does look bright for Baby Lasagna at the moment. New music is also just around the corner, with next singles and videos coming end of June and then end of summer, with the debut album planned for next winter.",
    "socials": {
      "website": "https://babylasagnamusic.com/",
      "facebook": null,
      "instagram": "https://www.instagram.com/the_baby_lasagna_",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCvF3sNJf_ueHl8gVdLb0PYA",
      "spotify": "https://open.spotify.com/artist/1ncWEkB4AQh1rxC8ObpBoH",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/baby-lasagna/1712556063"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580982_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Moshpit",
      "Rebellious",
      "Sing-along",
      "Feel-good",
      "Aggressive"
    ]
  },
  {
    "id": "18",
    "artist": "Bad Nerves",
    "stage": "Colosseum",
    "day": "Thursday",
    "startTime": "2026-08-13T18:30:00Z",
    "endTime": "2026-08-13T19:30:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ROCK",
      "PUNK ROCK"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064799-bad-nerves",
    "description": "The bastard child of a Ramones/Strokes one night stand, Bad Nerves play ferociously fast distorted pop songs. Their self-made debut and second album Still Nervous put them in the hearts and minds of the cream of the alternative crop; including rock legends such as Green Day’s Billie Joe Armstrong, Pearl Jam’s Stone Gossard, and Iggy Pop. Drawing comparisons to Supergrass, The Hives and Jay Reatard, they proactively seek to make the type of in-your-face, infectious rock music that the genre was built on. After a whirlwind three years, going from playing tiny sweaty rooms, to commanding stadium audiences, Bad Nerves has deservedly enamoured new fans across the world with their captivating 200mph live shows. Emerging as one of rock’n’roll’s most electrifying new exports, the band is currently working on their much anticipated third album.",
    "socials": {
      "website": "https://badnerves.co.uk/",
      "facebook": "https://www.facebook.com/badnerves",
      "instagram": "https://www.instagram.com/badbadnerves",
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCATELSxNP1QBuJ13-L4zSNw",
      "spotify": "https://open.spotify.com/artist/7IPyXY4ZHkuvQY1ny8TnMQ",
      "appleMusic": null,
      "soundcloud": "https://soundcloud.com/badnerves",
      "x": "https://x.com/badbadnerves"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/77/thumb_5576971_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Moshpit",
      "Rebellious"
    ]
  },
  {
    "id": "19",
    "artist": "Biia",
    "stage": "Colosseum",
    "day": "Friday",
    "startTime": "2026-08-14T18:00:00Z",
    "endTime": "2026-08-14T19:00:00Z",
    "countryCode": "PT",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECHNO"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064817-biia",
    "description": "BIIA is an eletronic music artist who brings an emotional curiosity that is so mirrored in her creative process.\n\nShe creates a journey of self-expression that blends different approaches of techno. These are energetic and hard-hitting stories that can combine raw, hard, 90's beats and peculiar sounds with different genres occasionally popping. Her productions express music, without boundaries that oozes trippy elements with screaming kicks and sectionally her provocative and conceptual vocal.\n\nBIIA, disruptive and unappreciative of labels, is a talent that stays true to her artitic vision.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/BIIA.music",
      "instagram": "https://www.instagram.com/biia__________",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCUBgNYtg3NBqtfond4QB3HA",
      "spotify": "https://open.spotify.com/artist/6aLjZidc4PrcXCrCnLzR6W",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/biia/1453017087",
      "soundcloud": "https://soundcloud.com/biiamusic"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577093_performance_1080.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Hard"
    ]
  },
  {
    "id": "20",
    "artist": "Brooke Combe",
    "stage": "Colosseum",
    "day": "Saturday",
    "startTime": "2026-08-15T18:30:00Z",
    "endTime": "2026-08-15T19:30:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "INDIE",
      "POP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064824-brooke-combe",
    "description": "\"I can walk into those rooms full of established male musicians and not apologise for being there. Fuck that!\" At 23 years of age, Scottish newcomer Brooke Combe is ready to call time on the accepted order of things, interrupting indie with an unapologetic attitude and a formidable roster of songs. A collection she has honed through a year of relentless gigging, each track on her mixtape has its heart in a long lineage of funk and soul, a retro sound that has earnt her endorsement from the likes of the BBC, Rolling Stone UK, The Skinny and NME. It's a style that could easily come across as mere pastiche but from the very first note of her rich vocal, there is no doubt that Brooke is carving her own path. 'Black Is The New Gold' allows her to work through her own understanding of race and identity, reflecting on reading she had been doing about histories of slavery and institutional oppression. Writing the lyrics almost in a state of unconsciousness it was only when she finished that she realised how close she had cut to personal bone.",
    "socials": {
      "website": "https://brookecombe.os.fan/",
      "facebook": "https://www.facebook.com/brookecombe99",
      "instagram": "https://www.instagram.com/brookecombe",
      "tiktok": "https://www.tiktok.com/@brooklyncombe",
      "youtube": "https://www.youtube.com/channel/UCEBlrVTKRZlK-tuIjmK3hLw",
      "spotify": "https://open.spotify.com/artist/0JXwYf8x27ZfMO2gGuh6HO",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/gb/artist/brooke-combe/1444637732",
      "x": "https://x.com/brookecombe"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577104_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric",
      "Sing-along",
      "Feel-good"
    ]
  },
  {
    "id": "21",
    "artist": "Cassia",
    "stage": "Europe Stage",
    "day": "Tuesday",
    "startTime": "2026-08-11T19:00:00Z",
    "endTime": "2026-08-11T20:00:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "INDIE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065312-cassia",
    "description": "Cassia’s new album everyone, outside marks a major artistic step for the trio, created back in their hometown of Macclesfield after time spent in Berlin. Returning to the countryside studio they built themselves helped them reconnect with their roots and rediscover the joy of making music. The album reflects this homecoming—organic, warm, and true to who they are. Its title symbolizes being your most natural, unburdened self. Featuring singles like friends, heat, forever, and the eclectic title track everyone, outside, the record blends their signature indie-pop/rock energy with influences from afrobeat and Cuban music, showcasing new maturity and creative freedom. After the album’s release, Cassia toured the UK, Europe, the US and Mexico with a reimagined live show full of instrumental dynamism and new percussive and electronic elements. These updated arrangements appear on the deluxe edition, which also includes the nostalgic new single Follow the Sun.",
    "socials": {
      "website": "https://www.wearecassia.com/",
      "facebook": "https://www.facebook.com/wearecassia",
      "instagram": "https://www.instagram.com/wearecassia",
      "tiktok": null,
      "youtube": "https://www.youtube.com/@wearecassia",
      "spotify": "https://open.spotify.com/artist/2413I9w4sRbBz4zi5zgwjX",
      "appleMusic": null,
      "soundcloud": "https://soundcloud.com/wearecassia",
      "x": "https://x.com/wearecassia"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/80/thumb_5579838_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric"
    ]
  },
  {
    "id": "22",
    "artist": "Charlotte Cardin",
    "stage": "Europe Stage",
    "day": "Wednesday",
    "startTime": "2026-08-12T19:30:00Z",
    "endTime": "2026-08-12T20:30:00Z",
    "countryCode": "CA",
    "genres": [
      "MUSIC",
      "INDIE",
      "POP",
      "ALT POP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064816-charlotte-cardin",
    "description": "Born in Montreal and based in Paris, Charlotte Cardin shines on the global stage with striking authenticity and emotional depth. Named Billboard’s Global Woman of the Year in 2025, the Canadian singer-songwriter has amassed over a billion streams worldwide and performed on renowned stages from Bonnaroo to Festival d’Été de Québec to Les Vieilles Charrues, earning praise from Harper’s BAZAAR, W Magazine, TF1, and Le Parisien. In late 2024, following a sold-out Zénith de Paris and a standout performance on Star Academy, she broke through with Feel Good, now the most-played francophone song on French radio with over 100 million streams worldwide. Her 2023 album 99 Nights expanded her international reach, earning JUNOs for Album and Pop Album of the Year. She first broke through with 2021’s Platinum-certified Phoenix, which won four JUNOs including Album of the Year and made her the first Canadian since Céline Dion to top the Canadian Billboard chart. In September 2025, Charlotte Cardin returns with a bold and undeniably addictive track : Tant pis pour elle. It’s the fantasy of flawless revenge. It’s patience meeting anger with grace, then setting it ablaze into something greater. Tant pis pour elle isn’t just a fiery follow-up to Feel Good : it shares its strength but carves out a new era, driven by fearless audacity and uncompromising authenticity — a statement track, crafted to define its moment and resonate far beyond its generation.",
    "socials": {
      "website": "https://www.charlottecardin.com/",
      "facebook": "https://www.facebook.com/charlottecardinofficial",
      "instagram": "https://www.instagram.com/charlottecardin",
      "tiktok": "https://www.tiktok.com/@charlottecardin",
      "youtube": "https://www.youtube.com/channel/UCIEcq0eG63LS-4J9M1qNj9Q",
      "spotify": "https://open.spotify.com/artist/1G0YV9WooUBjrwDq0Q7EFK",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/ca/artist/charlotte-cardin/784665014",
      "soundcloud": "https://soundcloud.com/charlottecardin",
      "x": "https://x.com/Charlottecardin"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577351_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric",
      "Sing-along",
      "Feel-good"
    ]
  },
  {
    "id": "23",
    "artist": "De'wayne",
    "stage": "Europe Stage",
    "day": "Thursday",
    "startTime": "2026-08-13T19:00:00Z",
    "endTime": "2026-08-13T20:00:00Z",
    "countryCode": "US",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "POP",
      "RAP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064812-de'wayne",
    "description": "Houston-born and LA-based singer, songwriter, multi-instrumentalist, and producer DE’WAYNE has amassed tens of millions of streams across STAINS (2021), My Favorite Blue Jeans (2022), and I WANT YOU MORE THAN ANYBODY WANTS YOU EP (2024). Following the latter, UPSET put him on its cover, while KERRANG! hailed him as “one of the most electrifying new performers in the alt. world today.”\n\nEqually at home collaborating with Chase Atlantic, Masego, IDKHOW, Waterparks, grandson, WILLOW, Good Charlotte, and Tom Morello, DE’WAYNE channels influences from Lenny Kravitz to Nina Simone. His latest work embraces the divine feminine with new openness, showcasing his growth as a proud Black man, son, friend, leader, artist, and lover.",
    "socials": {
      "website": "https://yeahdewayne.com/",
      "facebook": null,
      "instagram": "https://www.instagram.com/yeahdewayne",
      "tiktok": "https://www.tiktok.com/@yeahdewayne",
      "youtube": "https://www.youtube.com/channel/UCeZfPHDl7kucaCKDNs_G6Qw",
      "spotify": "https://open.spotify.com/artist/4lpKeKXJYkglSWyEmnOF7O",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/dewayne/1113740182",
      "x": "https://x.com/yeahdewaynehere"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577031_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Chill",
      "Atmospheric",
      "Sing-along",
      "Feel-good",
      "Flow",
      "Party"
    ]
  },
  {
    "id": "24",
    "artist": "Elefant",
    "stage": "Europe Stage",
    "day": "Friday",
    "startTime": "2026-08-14T19:30:00Z",
    "endTime": "2026-08-14T20:30:00Z",
    "countryCode": "BE",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "ALTERNATIVE",
      "ALTERNATIVE ROCK"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064820-elefant",
    "description": "Elefánt launched in 2012 with an unchanged lineup and quickly became a defining force in the Hungarian alternative scene. Their albums — Vérkeringő, Gomoly, Minden, and EL — brought growing acclaim, sold-out shows, and major industry recognition, with EL achieving double platinum and becoming Hungary’s most popular album of 2022. Between 2021 and 2023 they released several successful singles and the Gázgyár Live Session, followed by the 2023 double vinyl IKSZ, celebrating their first decade — marked by nationwide sold-out tours.",
    "socials": {
      "website": "https://www.elefantofficial.com/",
      "facebook": "https://www.facebook.com/elefantofficial",
      "instagram": "https://www.instagram.com/elefantofficial",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@elefantzenekar",
      "youtube": "https://www.youtube.com/channel/UClSqYZJAh9ZlJ_fCEmrFSzA",
      "spotify": "https://open.spotify.com/artist/5XXDBFhkTp168rjq9IjAE3",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/elef%C3%A1nt/927579435"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/82/thumb_5581840_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Chill",
      "Atmospheric",
      "Unique",
      "Live Band"
    ]
  },
  {
    "id": "25",
    "artist": "Giant Rooks",
    "stage": "Europe Stage",
    "day": "Saturday",
    "startTime": "2026-08-15T19:00:00Z",
    "endTime": "2026-08-15T20:00:00Z",
    "countryCode": "DE",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "INDIE ROCK",
      "INDIE POP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064628-giant-rooks",
    "description": "Over the past few years, Giant Rooks have successfully hit one milestone after another – selling out shows in Germany, North and South America and Europe, performing on the world’s biggest festival stages, and amassing hundreds of millions of streams. Since forming the band in 2015, Frederik Rabe (vocals), Finn Schwieters (guitar), Luca Göttner (bass), Jonathan Wischniowski (keyboard) and Finn Thomas (drums), have taken the indie scene by storm with hits like “Wild Stare” and “Morning Blue.” Their debut album, “Rookery” (2020) has over 220 million streams and reached #3 on the German album charts. About four years after their internationally successful debut, Giant Rooks released their long-awaited follow-up album “How Have You Been?“ on February 2nd, 2024, which even surpassed the success of their debut album and reached #1 in the German album charts. The album is a musical odyssey that navigates vivid and emotional landscapes, full of domestic minutiae and existential reckoning, much like the pages of a diary that are shamelessly honest, cutting, and from that deep place that is only known by the heart. \"How have you been?\" is a collection of songs that really define for the listener what Giant Rooks is all about. And as with “Rookery“, the feeling remains that this is by no means the end of the story. In 2025 the band ́s main focus is on writing and producing new songs. Only at the end of the summer will they play a few selected shows, including their long-awaited homecoming shows in their hometown of Hamm, Germany.",
    "socials": {
      "website": "https://www.giant-rooks.com/",
      "facebook": "https://www.facebook.com/giantrooks",
      "instagram": "https://www.instagram.com/giantrooksmusic",
      "tiktok": "https://www.tiktok.com/@giantrooks",
      "youtube": "https://www.youtube.com/@GiantRooks",
      "spotify": "https://open.spotify.com/artist/5wD0owYApRtYmjPWavWKvb",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/de/artist/giant-rooks/1181446985",
      "x": "https://x.com/giantrooksmusic"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577377_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Chill",
      "Atmospheric",
      "Sing-along",
      "Feel-good"
    ]
  },
  {
    "id": "26",
    "artist": "Jazzy",
    "stage": "Main Stage",
    "day": "Tuesday",
    "startTime": "2026-08-11T19:30:00Z",
    "endTime": "2026-08-11T20:30:00Z",
    "countryCode": "IE",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "HOUSE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065317-jazzy",
    "description": "As the most streamed female DJ globally, Dublin’s Jazzy is the most exciting artist in Ireland right now and a trailblazer for her homegrown music scene. The BRIT and Ivor Novello nominee has released a string of wide-ranging collaborations with global dance contemporaries, offering her infectious blend of unforgettable melodies and resonant lyrics to tracks with Rossi. (‘High On Me’), Ankhoï (‘Closer to the Floor’) KILIMANJARO (‘No Bad Vibes’) and Sonny Fodera & D.O.D (top 5 hit ‘Somedays’). \n\nA bonafide hitmaker, Jazzy has two number one singles in Ireland, as well as three top ten singles in the UK. With each new release further establishing her name within the dance music canon, Jazzy has been equally active on the live scene, with an incredible festival run with performances in 2025.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/Jazygirljazzy",
      "instagram": "https://www.instagram.com/jazzy",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCagcrKRy2laLZ6u3MD9z4Zw",
      "spotify": "https://open.spotify.com/artist/7zAAwgV5Wqmvpb4GzvlRkP",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/jazzy/1519246472"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580022_performance_1440.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Groovy"
    ]
  },
  {
    "id": "27",
    "artist": "Joris Voorn",
    "stage": "Main Stage",
    "day": "Wednesday",
    "startTime": "2026-08-12T19:00:00Z",
    "endTime": "2026-08-12T20:00:00Z",
    "countryCode": "NL",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECHNO",
      "TECH-HOUSE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064810-joris-voorn",
    "description": "Joris Voorn is a leading Dutch DJ and producer, known for his genre-blending house and techno, acclaimed albums, and global performances. He runs the Green and Rejected labels and showcases his wide musical spectrum through his Spectrum radio show and events.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/jorisvoorndj",
      "instagram": "https://www.instagram.com/jorisvoorn",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCXn-jxml9VfSPdnuPfjwRtg",
      "spotify": "https://open.spotify.com/artist/4jGpKAmwvU263l0tUh4xKU",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/joris-voorn/121949655",
      "soundcloud": "https://soundcloud.com/joris-voorn"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577028_performance_1440.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Hard",
      "Groovy"
    ]
  },
  {
    "id": "28",
    "artist": "Karen Dio",
    "stage": "Main Stage",
    "day": "Thursday",
    "startTime": "2026-08-13T19:30:00Z",
    "endTime": "2026-08-13T20:30:00Z",
    "countryCode": "BR",
    "genres": [
      "MUSIC",
      "ROCK",
      "INDIE",
      "PUNK ROCK",
      "POP PUNK"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065318-karen-dio",
    "description": "Karen Dió is a rising force in alternative music, making waves with her high-energy performances and fearless sound. Fresh off sold-out headline shows in London and Brighton, she’s captivated audiences with raw intensity and undeniable stage presence. Karen has already shared stages with heavyweights like Limp Bizkit, Sum 41 and Wargasm, proving she can hold her own alongside rock’s biggest names. With an explosive live show and a growing fanbase, she’s gearing up to hit the road all summer ahead of a series of shows with Avenged Sevenfold this fall, solidifying her place in the next generation of rock. Karen Dió is not just arriving—she’s here to take over.",
    "socials": {
      "website": "https://karend.io/",
      "facebook": "https://www.facebook.com/karendioxx",
      "instagram": "https://www.instagram.com/karendioxx",
      "tiktok": "https://www.tiktok.com/@karendioxx",
      "youtube": "https://www.youtube.com/channel/UCBOHlhgb7PFXNNX36NeEtSA",
      "spotify": "https://open.spotify.com/artist/5VVMZArxuM1mO8Qny95inw",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/karen-di%C3%B3/1288070224",
      "x": "https://x.com/karendioxx"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580023_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Chill",
      "Atmospheric",
      "Moshpit",
      "Rebellious",
      "Sing-along",
      "Feel-good"
    ]
  },
  {
    "id": "29",
    "artist": "Kim Dracula",
    "stage": "Main Stage",
    "day": "Friday",
    "startTime": "2026-08-14T19:00:00Z",
    "endTime": "2026-08-14T20:00:00Z",
    "countryCode": "AU",
    "genres": [
      "MUSIC",
      "ROCK",
      "ALTERNATIVE",
      "METAL"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065316-kim-dracula",
    "description": "Surfacing from the flesh-eating diseases and torrential wildfires of Australia, Kim Dracula has arrived to create turbulent, creative art that mirrors the chaotic world around us. On the track “Make Me Famous”, we reach a gluttonous feast of violence, chaos and satire. In addition to being extreme and multi-faceted lyrically and visually, “Make Me Famous” dwarfs Dracula’s previous musical output by abrasively combining multiple styles, composed instrumentally by Kim Dracula themselves, including metal, industrial, jazz, trap and Latin music in a single song without flying off the rails. Dracula’s latest release “Drown” is a more melodic song that packs the same eclectic punch they’re making a name for, fusing styles such as post hardcore with synthwave, industrial, edm and metal. Between their musical composition, extreme visuals, and lack of desire to fit into any specific box, Dracula is earning a devoted following in all different communities, changing the future of music as we know it.",
    "socials": {
      "website": "https://www.kimdracula.com/",
      "facebook": "https://www.facebook.com/KimDrac",
      "instagram": "https://www.instagram.com/kimdrac",
      "tiktok": "https://www.tiktok.com/@kimdrac",
      "youtube": "https://www.youtube.com/channel/UC1Zvw4vEriIZta80U_pUEaA",
      "spotify": "https://open.spotify.com/artist/526TMJFuJibm9j2p9td9Yp",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/kim-dracula/1515996704",
      "x": "https://x.com/kimdrac"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580024_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Unique",
      "Live Band",
      "Moshpit",
      "Aggressive"
    ]
  },
  {
    "id": "30",
    "artist": "Lambrini Girls",
    "stage": "Main Stage",
    "day": "Saturday",
    "startTime": "2026-08-15T19:30:00Z",
    "endTime": "2026-08-15T20:30:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ROCK",
      "PUNK ROCK"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064848-lambrini-girls",
    "description": "Lambrini Girls have released their long-awaited debut album Who Let The Dogs Out via City Slang. With their record in-stores starting today, most of which are sold-out, and a UK April headline tour, which are also almost sold-out, they have now announced their return to the US to follow after.\n\nAlready gracing the covers of DIY, NME, Kerrang! Magazine, NOTION, and features with the likes of Variety, The Line Of Best Fit, BBC Radio 1, and more to come, the Brighton-based duo of Phoebe Lunny (vocals/guitar) and Selin Macieira (bass) have spent the last few years on a tear in more ways than one.\n\nWho Let The Dogs Out bottles everything wrong with the modern world and shakes it up. If peppering political songs with humour is like sticking a sparkler in some bread, then their debut is like a fireworks display in the factory itself: strange, dangerous, exciting, and it rips through a laundry list of social ills.\n\n“You know how Fleetwood Mac almost dedicated Rumours to their cocaine dealer? I think we should dedicate this album to all the booze we bought at Tesco.”",
    "socials": {
      "website": "https://www.lambrinigirlsband.co.uk/",
      "facebook": "https://www.facebook.com/LambriniGirlsband",
      "instagram": "https://www.instagram.com/lambrinigirlz",
      "tiktok": "https://www.tiktok.com/@lmbrinigrls",
      "youtube": "https://www.youtube.com/channel/UCr33PPOQ3kfnONhM6a49CGA",
      "spotify": "https://open.spotify.com/artist/6VR4TJ20WGiho2xZWMuuWb",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/us/artist/lambrini-girls/1541291393",
      "x": "https://x.com/Lambrini_Girls"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577153_performance_1440.jpeg",
    "vibes": [
      "High Energy",
      "Anthemic",
      "Moshpit",
      "Rebellious"
    ]
  },
  {
    "id": "31",
    "artist": "Makrohang",
    "stage": "Revolut Stage",
    "day": "Tuesday",
    "startTime": "2026-08-11T20:00:00Z",
    "endTime": "2026-08-11T21:00:00Z",
    "countryCode": "HU",
    "genres": [
      "MUSIC",
      "METAL",
      "JAZZ"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064795-makrohang",
    "description": "Unpredictable, loud and heartbreakingly beautiful instrumental music from Eastern Europe that takes you places. “JAZZ FOR METALHEADS” - this is how they describe their own music, which they perform on stage with elemental energy, traversing the most extreme moods from aggressive heaviness to sentimental ballads and epic openings. After their formation in 2014, they quickly achieved domestic and international success: they played on European stages, won A38’s talent contest, the Talentométer, toured Central Europe, and performed as support for international acts such as Shigeto, La Dispute, and Elektro Guzzi. After a sudden breakup and a six-year hiatus, the band returned in 2023 with sold-out concerts in Budapest - including a show at the House of Hungarian Music. In 2024 they began performing again in Hungary, and in 2025 they relaunched their international concert series at the Eurosonic NL and Ment Ljubljana festivals, then completed their first LP, makrohang, in March.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/Makrohang",
      "instagram": "https://www.instagram.com/makrohang",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCzxA-xsVFDDWSu_Ol6EQzZg",
      "spotify": "https://open.spotify.com/artist/2wJqtskPv8w80vzRU7zkqr",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/makrohang/993711157"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580975_performance_1080.jpeg",
    "vibes": [
      "Moshpit",
      "Aggressive"
    ]
  },
  {
    "id": "32",
    "artist": "Oskar Med K",
    "stage": "Revolut Stage",
    "day": "Wednesday",
    "startTime": "2026-08-12T20:30:00Z",
    "endTime": "2026-08-12T21:30:00Z",
    "countryCode": "NO",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "HOUSE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065314-oskar-med-k",
    "description": "Up and coming Norwegian producer oskar med k crafts a sound where chill, melodic house meets infectious, masterful songwriting. His immersive productions blend club centric beats, infectious melodies, and ethereal vocals, showcasing an emotional depth that has been catching the ears of many in the industry.\n\nOskar’s talent and distinct style have propelled him onto the electronic music scene in a matter of months. His latest single, a collaboration with acclaimed Chill House producer Avaion, has received numerous Spotify editorial placements, garnering over a million streams in its first two weeks. With each release, he continues to push boundaries, crafting soundscapes that transport listeners into a new world of emotion and rhythm.",
    "socials": {
      "website": null,
      "facebook": null,
      "instagram": "https://www.instagram.com/_oskarmedk",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCGsA0QpZe1bY9ClHw6guF5g",
      "spotify": "https://open.spotify.com/artist/28ntgpEkMU9Zm7F3gLDMhZ",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/oskar-med-k/1671429234",
      "soundcloud": "https://soundcloud.com/oskarmedkmedk"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580025_performance_1440.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Groovy"
    ]
  },
  {
    "id": "33",
    "artist": "Pan Pot",
    "stage": "Revolut Stage",
    "day": "Thursday",
    "startTime": "2026-08-13T20:00:00Z",
    "endTime": "2026-08-13T21:00:00Z",
    "countryCode": "DE",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECHNO",
      "TECH-HOUSE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064838-pan-pot",
    "description": "Pan-Pot, the Berlin techno duo of Tassilo Ippenberger and Thomas Benedix, are known for their dark, minimal, and experimental sound. Since their 2007 debut Pan-O-Rama, they’ve released multiple albums, founded the label Second State, and toured major festivals worldwide. Their 2023 album FORTE and its 2024 remix project showcase their evolving style. Beyond music, they influence fashion and remain leading figures in electronic music.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/PanPotOfficial",
      "instagram": "https://www.instagram.com/panpotofficial",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/@Pan-Pot",
      "spotify": "https://open.spotify.com/artist/6OQOvP7RAdmAKVXXQqD0Se",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/pan-pot/211291988",
      "soundcloud": "https://soundcloud.com/pan-pot"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577109_performance_1440.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Hard",
      "Groovy"
    ]
  },
  {
    "id": "34",
    "artist": "Paris Paloma",
    "stage": "Revolut Stage",
    "day": "Friday",
    "startTime": "2026-08-14T20:30:00Z",
    "endTime": "2026-08-14T21:30:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "INDIE",
      "ALTERNATIVE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064819-paris-paloma",
    "description": "Originally hailing from Ashbourne, Derbyshire, Paris Paloma channels the experience of womanhood into her songwriting, speaking to the female experience, grief, love, death, and power. Her songwriting reads like poetry, drawing inspiration from figures throughout mythology, art history and the Romantics. Ranging from the tender and heartbreaking to the sublimely aggressive and vengeful. Her ethereal sound takes influences from dark pop, folk, and indie genres; creating a magical discography that evokes something primal and innately feminine.",
    "socials": {
      "website": "https://www.parispaloma.co.uk/",
      "facebook": "https://www.facebook.com/parispalomamusic",
      "instagram": "https://www.instagram.com/parispaloma",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@parispalomaofficial",
      "youtube": "https://www.youtube.com/channel/UCdNen4E3nI4P5_5M8s1hz1w",
      "spotify": "https://open.spotify.com/artist/2EXpthNgSeTDeX8nGwxppp",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/paris-paloma/1530898376"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577097_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric",
      "Unique",
      "Live Band"
    ]
  },
  {
    "id": "35",
    "artist": "Sim0ne",
    "stage": "Revolut Stage",
    "day": "Saturday",
    "startTime": "2026-08-15T20:00:00Z",
    "endTime": "2026-08-15T21:00:00Z",
    "countryCode": "UK",
    "genres": [
      "MUSIC",
      "ELECTRONIC",
      "TECHNO",
      "HOUSE"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065319-sim0ne",
    "description": "Since 2023, sim0ne has ascended from bedroom DJ/Producer to BBC Radio 1’s Future Star of 2024 and the face of TikTok’s #ElectronicMusic campaign 2025. The Edinburgh-born, London-based artist has won global support from peers like horsegiirL, Tohji and Two Shell, alongside widespread acclaim for her viral remixes—including her official remix of Lana Del Rey’s “Say Yes To Heaven”. Her high-energy blends of hard house, happy hardcore, techno and trance have landed her a Rinse FM residency, a BBC Radio 6 Music guest mix, as well as performances at Fabric, Glastonbury, ADE, Reading & Leeds, and more. Back in 2023, she launched her sold-out event series club zer0, which returns this Autumn in larger venues, with support from Warehouse Project and Broadwick Live. Most recently, sim0ne delivered a standout homecoming performance at Edinburgh Castle, and has appeared on a celebrated Mixmag live stream from Poland. With a relentless touring schedule that has also included Ibiza for Boiler Room and Pukkelpop, sim0ne continues to shape the sound of the dance floor on a global scale. Keep your eyes peeled for more in the coming weeks.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/sim0nelovesu",
      "instagram": "https://www.instagram.com/sim0ne",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@__sim0ne_",
      "youtube": "https://www.youtube.com/channel/UCeaPLKGZw0x5cKQWlQo6iNw",
      "spotify": "https://open.spotify.com/artist/68sBUNLfzCGR5n2nImhFCV",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/sim0ne/1662628227",
      "soundcloud": "https://soundcloud.com/sim0nelovesu"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580976_performance_1440.jpeg",
    "vibes": [
      "Dance",
      "Rave",
      "Hard",
      "Groovy"
    ]
  },
  {
    "id": "36",
    "artist": "Sisi",
    "stage": "Bolt Party Arena",
    "day": "Tuesday",
    "startTime": "2026-08-11T20:30:00Z",
    "endTime": "2026-08-11T21:30:00Z",
    "countryCode": "HU",
    "genres": [
      "MUSIC",
      "HIP-HOP",
      "RAP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064823-sisi",
    "description": "Sisi is one of today’s most successful performers in the Hungarian rap and hip-hop scene. She first drew the attention of both the audience and the industry with her self-made music videos and a lyrical style that brought a fresh new flavor, later earning the Artisjus Junior Songwriter Award and becoming an ambassador for Spotify’s EQUAL campaign. Sisi’s first track and DIY music video, titled “Yalla,” was released in 2022, followed by “Rappelj jobban,” the song that truly propelled her into the public spotlight. After an EP and several successful singles, her first full-length album, “SISTAHOOD,” was released in 2023. Her concerts are special and always offer something new thanks to her unique performance style and creative ideas. Over the past three years, she has progressed from clubs and festivals to headlining her own show at Budapest Park—an exceptional achievement for a female rapper in Hungary. Beyond her music, she speaks out only on topics that are personally important to her, whether it’s mental health, public affairs, faith, or the role of women in society.",
    "socials": {
      "website": null,
      "facebook": "https://www.facebook.com/thesisiwolf",
      "instagram": "https://www.instagram.com/thesisiwolf",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCrZXGpVD71gx2HA_OFCVubQ",
      "spotify": "https://open.spotify.com/artist/6DM0KWyDnsqdKIfFvk6d8f",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/sisi/1637624080"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577103_performance_1440.jpeg",
    "vibes": [
      "Flow",
      "Party"
    ]
  },
  {
    "id": "37",
    "artist": "Ski Aggu",
    "stage": "Bolt Party Arena",
    "day": "Wednesday",
    "startTime": "2026-08-12T20:00:00Z",
    "endTime": "2026-08-12T21:00:00Z",
    "countryCode": "DE",
    "genres": [
      "MUSIC",
      "HIP-HOP",
      "RAP"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2064825-ski-aggu",
    "description": "Ski Aggu, the Berlin rapper with the distinctive ski goggles, has made a name for himself with his unique style, rousing tracks, and clever use of wordplay. He captivates listeners with songs that combine lightheartedness and depth, addressing everyday situations, party excesses, and pop culture topics, often with a wink. He currently reaches over 5 million monthly listeners on Spotify, which attests to his wide- reaching appeal. His successes to date speak for themselves: numerous gold and platinum awards, several #1 placements in the Official German Charts, and 1LIVE crowns for “Best Artist” and “Best Song” underscore his standing in the scene. Highlights in 2025 included a sold-out European tour through 11 countries, his first shows in the US, and appearances at the biggest festivals in Germany, Austria, and Switzerland, including Splash!, Open Air St. Gallen, and Deichbrand. Ski Aggu is no studio phenomenon: his live shows are engaging, interactive, and full of energy. With his distinctive style, he brings this very dynamic to festival stages in 2026, guaranteeing unforgettable moments for fans of all generations.",
    "socials": {
      "website": null,
      "facebook": null,
      "instagram": "https://www.instagram.com/wer.ist.aggu",
      "twitter": null,
      "tiktok": null,
      "youtube": "https://www.youtube.com/channel/UCdkaGs5QIOc0L8U4R7V-Qpw",
      "spotify": "https://open.spotify.com/artist/6CP5wWvO8oIxedESJNCN4H",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/ski-aggu/1538538452",
      "soundcloud": "https://soundcloud.com/ski-aggu"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/78/thumb_5577107_performance_1440.jpeg",
    "vibes": [
      "Flow",
      "Party"
    ]
  },
  {
    "id": "38",
    "artist": "Zimmer90",
    "stage": "Bolt Party Arena",
    "day": "Thursday",
    "startTime": "2026-08-13T20:30:00Z",
    "endTime": "2026-08-13T21:30:00Z",
    "countryCode": "DE",
    "genres": [
      "MUSIC",
      "INDIE",
      "ELECTRONIC"
    ],
    "szigetUrl": "https://szigetfestival.com/en/programs-lineup-2026#/artist/2065320-zimmer90",
    "description": "Zimmer90 is an alternative-pop band from Germany, consisting of Finn and Josch. The name Zimmer90 (which means “room90” in German) reflects their creative project, where they combine their interests in music, design, and art. They create a soft yet danceable sound, featuring soothing synth pads, disco-esque basslines, and percussion-heavy dance beats, along with Josch’s soft and distinct voice. In 2023, they played 28 sold-out headline shows and over 40 festivals in Germany, Switzerland, and Austria. The following year, they went on their first EU Tour (sold out) including London, Paris and Amsterdam followed by their first US Tour and a very successful gig at the Corona Capital in Mexico City and played over 50 shows in 2024 in total. Their unique sound has gained a lot of international attention: the single “What Love Is” became the soundtrack for millions of recap videos on social media. In 2025, Zimmer90 will go on their biggest tour yet, playing shows across GSA and Europe, and appearing at several festivals throughout the summer. In September, they’ll release their debut album, followed by three tastemaker shows in the U.S. and Mexico (New York, Los Angeles, Mexico City). Looking ahead to 2026, Zimmer90 will continue with the release of their second album and a world tour to further establish their global reach. What sets them apart is their tasteful aesthetic, which is evident in their music, lyrics, and social media presence.",
    "socials": {
      "website": "https://www.zimmer90.com/",
      "facebook": "https://www.facebook.com/zimmer90music",
      "instagram": "https://www.instagram.com/zimmer90music",
      "twitter": null,
      "tiktok": "https://www.tiktok.com/@zimmer90music",
      "youtube": "https://www.youtube.com/channel/UCG0hl8b5xpQpEAuAeQJEm1g",
      "spotify": "https://open.spotify.com/artist/7cViIoKAQrjHURdxb9ACCX",
      "appleMusic": "https://music.apple.com/us/artist/https://music.apple.com/hu/artist/zimmer90/1500576149",
      "soundcloud": "https://soundcloud.com/zimmer90"
    },
    "imageUrl": "https://media.appmiral.com/prod/performance/0056/81/thumb_5580027_performance_1440.jpeg",
    "vibes": [
      "Chill",
      "Atmospheric",
      "Dance",
      "Rave"
    ]
  }
]